#Pre-test loop

#while เงื่อนไขที่เป็นจริง
#   ย่อหน้านี้ใส่คำสั่งวนloop

#while expression:
    # statements


# ก็จะให้ 0 ไปยังค่า x เป็นตัวควบคุมเพือจะเพิ่มค่า เพื่อจะทำให้เงื่อนไขนั้นเป็นเท็จและหลุดจากloop
# เขียนคำว่า while เป็นเงื่อนไขของการวนloop แบบ pre-test loop
# ก็คือเราจะเขียนคำว่า while ตามด้วยเงื่อนไขที่เป็นจริง ตราบใดที่ xยังน้อยกว่า10
#   เราก็จะprint(x) ออกมา
#   แล้วก็ทำการเพิ่มค่า x ขึ้นไป1ค่า ถ้า x ยังน้อยกว่า10 ก็ยังทำงานในloopนี้ต่อ จนกว่า xมากกว่าหรือเท่ากับ10ก็จะหลุดออกมาจากloop
#   x = x + 1

x = 0
while x < 10:
    print(x)
    x = x + 1